Revit 2026 API

# IFCFileModelOptions Properties

---

The IFCFileModelOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CacheSize | The cache size of the file. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SchemaFile | The full name of an IFC schema file. |
|  | SchemaName | The name of the schema. |
|  | UserControlledInverses | Indicates if the inverses are controlled by Revit or users. True by users, false by Revit. |

#### Reference

IFCFileModelOptions Class

Autodesk.Revit.DB.IFC Namespace